// 1 ==================================================

function createSecretHolder(secret){
    let obj = {
  
      getSecret()  {
        return secret
      },
  
      setSecret(newSecret) {
        secret = newSecret
      }
    }
  
    return obj
  }
// ===================================================


// 2 =================================================

const sorry = 'Извините, с битовкой не справился. Получается только с новым массивом.'
// .sort((a,b)=>(a-b)) ===================================================


// 3 =================================================
function myLanguages(results) {
    return Object.keys(results).filter(v=>results[v]>=60).sort((a,b)=>results[b]-results[a])
  }
// ===================================================


// 4 =================================================

for (var i = 0; i < 5; i++) {
      console.log(i);
  }
  
// ===================================================